{
   "Python": {
      "percentage": 0.9,
      "description": "I learned Python through a mixture of lectures in university and a variety of programming projects. My project studies on paper recommendations and my bachelor's thesis on author interdisciplinarity - both with a heavy focus on Natural Language Processing and Machine Learning - were written in Python."
   },
   "JavaScript": {
      "percentage": 0.8,
      "description": "Being able to present my research projects using clean and intuitive project codes has always been a priority to me. I therefore programmed several projects using the React.js framework combined with my theoretical Java knowledge through lectures in university."
   },
   "Java": {
      "percentage": 0.7,
      "description": "Java was the main programming language that TUM uses to introduce their students to programming. Throughout my courses at TUM, I was able to gain a deep knowledge of the Java programming language including parallelization, streams, memory management, collections and hashing. Additionally, I was a teaching assistant in Introduction to Software Engineering in Java."
   },
   "R": {
      "percentage": 0.5,
      "description": "I used R throughout several statistical lectures during my bachelor's degree such as Introduction to Unsupervised Learning and Introduction to Statistics. I familiarized myself with data collection and manipulation, dimensionality reduction, clustering, and multivariate statistics."
   },
   "C": {
      "percentage": 0.3,
      "description": "I learned C throughout the course operating systems and systems software during my bachelor's degree. I implemented pipes, threads, processes, memory allocation algorithms, and scheduling algorithms."
   },
   "OCaml": {
      "percentage": 0.2,
      "description": "OCaml was the programming language that we used throughout the course functional programming and verification that was geared towards formalizing control flows in computer programs."
   }
}